AchimPieters/esp32-homekit-Sunshade/main/main.c
/**
   Copyright 2026 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
 **/

/*
 * TTP223 SUNSHADE VERSION
 * ───────────────────────
 * This version uses 3 external TTP223 capacitive touch modules.
 *
 * Hardware:
 *   UP    TTP223 SIG -> GPIO32
 *   STOP  TTP223 SIG -> GPIO33
 *   DOWN  TTP223 SIG -> GPIO27
 *
 * Physical lifecycle button:
 *   GND -> button -> GPIO25
 *
 * TTP223 modules should be configured as:
 *   - momentary mode
 *   - active-high output
 *   - VCC = 3V3
 *   - GND = GND
 */

#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>

#include <esp_log.h>
#include <esp_err.h>
#include <esp_timer.h>
#include <nvs.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <driver/gpio.h>

#ifdef CONFIG_WIND_SENSOR_ENABLE
#include <esp_adc/adc_oneshot.h>
#endif

#include <homekit/homekit.h>
#include <homekit/characteristics.h>

#include "esp32-lcm.h"
#include <button.h>

// ── GPIO pin assignments ───────────────────────────────────────────────────────
#define LED_GPIO            CONFIG_ESP_LED_GPIO
#define BUTTON_GPIO         CONFIG_ESP_BUTTON_GPIO
#define RELAY_OPEN_GPIO     CONFIG_ESP_RELAY_OPEN_GPIO
#define RELAY_CLOSE_GPIO    CONFIG_ESP_RELAY_CLOSE_GPIO

#define TTP_UP_GPIO         CONFIG_ESP_TTP_UP_GPIO
#define TTP_STOP_GPIO       CONFIG_ESP_TTP_STOP_GPIO
#define TTP_DOWN_GPIO       CONFIG_ESP_TTP_DOWN_GPIO

#define TTP_ACTIVE_LEVEL    CONFIG_ESP_TTP_ACTIVE_LEVEL

// ── Timing ────────────────────────────────────────────────────────────────────
#define DEFAULT_TRAVEL_MS       CONFIG_SUNSHADE_FULL_TRAVEL_TIME_MS
#define POS_UPDATE_INTERVAL_MS  500

#define ENDSTOP_BUFFER_FACTOR   1.5f
#define CAL_OPEN_MAX_MS         120000u

#define TTP_POLL_MS             CONFIG_ESP_TTP_POLL_MS
#define TTP_DEBOUNCE_MS         CONFIG_ESP_TTP_DEBOUNCE_MS
#define CAL_HOLD_TRIGGER_MS     3000u

// ── NVS ───────────────────────────────────────────────────────────────────────
#define NVS_NS          "shade"
#define NVS_CAL_DONE    "cal_done"
#define NVS_CAL_MS      "cal_ms"
#define NVS_LAST_POS    "last_pos"

// ── Wind sensor (optional) ────────────────────────────────────────────────────
#ifdef CONFIG_WIND_SENSOR_ENABLE
#define WIND_ADC_GPIO            CONFIG_WIND_SENSOR_ADC_GPIO
#define WIND_ADC_FULL_SCALE_MV   CONFIG_WIND_SENSOR_ADC_FULL_SCALE_MV
#define WIND_MAX_SPEED_DS        CONFIG_WIND_SENSOR_MAX_SPEED_DS
#define WIND_CLOSE_THRESHOLD_DS  CONFIG_WIND_SENSOR_CLOSE_THRESHOLD_DS
#define WIND_REOPEN_THRESHOLD_DS CONFIG_WIND_SENSOR_REOPEN_THRESHOLD_DS
#define WIND_POLL_MS             CONFIG_WIND_SENSOR_POLL_MS
#endif

// ── Log tags ──────────────────────────────────────────────────────────────────
static const char *TAG        = "SUNSHADE";
static const char *TAG_TOUCH  = "TTP223";
static const char *TAG_BUTTON = "BUTTON";
static const char *TAG_RELAY  = "RELAY";
static const char *TAG_CAL    = "CAL";
static const char *TAG_NVS    = "NVS";
#ifdef CONFIG_WIND_SENSOR_ENABLE
static const char *TAG_WIND   = "WIND";
#endif

// ── Motion state ──────────────────────────────────────────────────────────────
typedef enum {
    MOTION_CLOSING = 0,
    MOTION_OPENING = 1,
    MOTION_STOPPED = 2,
} motion_dir_t;

static volatile int          s_cur_pos      = 0;
static volatile int          s_tgt_pos      = 0;
static volatile motion_dir_t s_motion       = MOTION_STOPPED;
static volatile TaskHandle_t s_move_task    = NULL;
static volatile bool         s_task_creating = false;
static portMUX_TYPE          s_task_mux     = portMUX_INITIALIZER_UNLOCKED;

// ── Calibration state ─────────────────────────────────────────────────────────
typedef enum {
    CAL_IDLE    = 0,
    CAL_CLOSING,
    CAL_OPENING,
} cal_state_t;

static volatile cal_state_t s_cal_state   = CAL_IDLE;
static volatile bool        s_cal_done    = false;
static volatile uint32_t    s_cal_ms      = DEFAULT_TRAVEL_MS;
static volatile uint32_t    s_cal_t0_ms   = 0;
static volatile bool        s_is_homing   = false;
static volatile bool        s_cal_success = false;

// ── Wind protection state ─────────────────────────────────────────────────────
#ifdef CONFIG_WIND_SENSOR_ENABLE
static volatile bool s_wind_closed    = false;
static volatile int  s_wind_saved_pos = 0;
#endif

// ── Forward declarations ───────────────────────────────────────────────────────
static void sunshade_stop(void);
static void sunshade_move_to(int target);
static void relays_all_off(void);
static void homekit_notify_position(void);
static void calibration_confirm_open(void);
static void hold_position_setter(homekit_value_t value);

// ── Timing helper ─────────────────────────────────────────────────────────────
static inline uint32_t now_ms(void) {
    return (uint32_t)(esp_timer_get_time() / 1000ULL);
}

// ── NVS helpers ───────────────────────────────────────────────────────────────
static void nvs_load_calibration(void) {
    nvs_handle_t h;

    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) {
        ESP_LOGI(TAG_NVS, "No calibration found; using default %lu ms",
                 (unsigned long)DEFAULT_TRAVEL_MS);
        return;
    }

