AchimPieters/esp32-homekit-Sunshade/main/main.c
static void movement_task_start(void) {
    // Two-phase flag prevents dual-core TOCTOU: both cores seeing NULL simultaneously
    // and each spawning a duplicate movement task.
    bool create = false;

    taskENTER_CRITICAL(&s_task_mux);
    if (s_move_task == NULL && !s_task_creating) {
        s_task_creating = true;
        create = true;
    }
    taskEXIT_CRITICAL(&s_task_mux);

    if (!create) {
        return;
    }

    if (xTaskCreate(movement_task, "sunshade_move", 4096, NULL, 5,
                    (TaskHandle_t *)&s_move_task) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create movement task");
        relays_all_off();
        s_motion = MOTION_STOPPED;
        homekit_notify_position();
    }

    taskENTER_CRITICAL(&s_task_mux);
    s_task_creating = false;
    taskEXIT_CRITICAL(&s_task_mux);
}

// ── Sunshade control ──────────────────────────────────────────────────────────
static bool is_locked(void) {
    if (s_cal_state != CAL_IDLE) {
        ESP_LOGW(TAG, "Command ignored: calibration in progress");
        return true;
    }

    if (s_is_homing) {
        ESP_LOGW(TAG, "Command ignored: homing in progress");
        return true;
    }

    return false;
}

static void sunshade_open(void) {
    if (is_locked()) {
        return;
    }

    if (s_cur_pos >= 100) {
        ESP_LOGI(TAG, "Already fully open");
        return;
    }

    ESP_LOGI(TAG, "Opening: %d%% -> 100%%", s_cur_pos);

    relays_all_off();
    s_tgt_pos           = 100;
    s_motion            = MOTION_OPENING;
    target_pos_ch.value = HOMEKIT_UINT8(100);

    relay_activate_open();
    homekit_notify_position();
    nvs_save_last_position(100);
    movement_task_start();
}

static void sunshade_close(void) {
    if (is_locked()) {
        return;
    }

    if (s_cur_pos <= 0) {
        ESP_LOGI(TAG, "Already fully closed");
        return;
    }

    ESP_LOGI(TAG, "Closing: %d%% -> 0%%", s_cur_pos);

    relays_all_off();
    s_tgt_pos           = 0;
    s_motion            = MOTION_CLOSING;
    target_pos_ch.value = HOMEKIT_UINT8(0);

    relay_activate_close();
    homekit_notify_position();
    nvs_save_last_position(0);
    movement_task_start();
}

static void sunshade_stop(void) {
    if (s_cal_state == CAL_OPENING) {
        calibration_confirm_open();
        return;
    }

    if (is_locked()) {
        return;
    }

    ESP_LOGI(TAG, "Stop at %d%%", s_cur_pos);

    s_motion            = MOTION_STOPPED;
    s_tgt_pos           = s_cur_pos;
    target_pos_ch.value = HOMEKIT_UINT8((uint8_t)s_cur_pos);

    relays_all_off();
    homekit_notify_position();
    nvs_save_last_position((uint8_t)s_cur_pos);
}

static void sunshade_move_to(int target) {
    if (is_locked()) {
        return;
    }

    if (target < 0) {
        target = 0;
    } else if (target > 100) {
        target = 100;
    }

    if (target == s_cur_pos) {
        sunshade_stop();
        return;
    }

    relays_all_off();

    s_tgt_pos           = target;
    target_pos_ch.value = HOMEKIT_UINT8((uint8_t)target);

    if (target > s_cur_pos) {
        ESP_LOGI(TAG, "Move to %d%% (opening)", target);
        s_motion = MOTION_OPENING;
        relay_activate_open();
    } else {
        ESP_LOGI(TAG, "Move to %d%% (closing)", target);
        s_motion = MOTION_CLOSING;
        relay_activate_close();
    }

    homekit_notify_position();
    nvs_save_last_position((uint8_t)target);
    movement_task_start();
}

// ── HomeKit setters ───────────────────────────────────────────────────────────
static void target_position_setter(homekit_value_t value) {
    if (value.format != homekit_format_uint8) {
        ESP_LOGE(TAG, "target_position: unexpected format %d", value.format);
        return;
    }

    ESP_LOGI(TAG, "HomeKit -> target_position: %d%%", value.uint8_value);
    sunshade_move_to((int)value.uint8_value);
}

static void hold_position_setter(homekit_value_t value) {
    if (value.format != homekit_format_bool) {
        ESP_LOGE(TAG, "hold_position: unexpected format %d", value.format);
        return;
    }

    if (value.bool_value) {
        ESP_LOGI(TAG, "HomeKit -> hold_position: stop");
        sunshade_stop();
    }
}

// ── Calibration ───────────────────────────────────────────────────────────────
static void calibration_led_task(void *arg) {
    while (s_cal_state != CAL_IDLE) {
        uint32_t half = (s_cal_state == CAL_CLOSING) ? 100 : 400;

        led_write(true);
        vTaskDelay(pdMS_TO_TICKS(half));
        led_write(false);
        vTaskDelay(pdMS_TO_TICKS(half));
    }

    if (s_cal_success) {
        // 5 short flashes = success
        for (int i = 0; i < 5; i++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(60));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(60));
        }
    } else {
        // 3 long flashes = failed / aborted / timeout
        for (int i = 0; i < 3; i++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(400));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(200));
        }
    }

    vTaskDelete(NULL);
}

static void calibration_confirm_open(void) {
    uint32_t elapsed = now_ms() - s_cal_t0_ms;

    relays_all_off();

    if (elapsed < 2000) {
        ESP_LOGW(TAG_CAL, "Aborted: STOP pressed too soon (%lu ms)",
                 (unsigned long)elapsed);
        s_cal_success        = false;
        s_cal_state          = CAL_IDLE;
        s_cur_pos            = 0;
        s_tgt_pos            = 0;
        s_motion             = MOTION_STOPPED;
        current_pos_ch.value = HOMEKIT_UINT8(0);
        target_pos_ch.value  = HOMEKIT_UINT8(0);
        homekit_notify_position();
        return;
    }

    s_cal_ms             = elapsed;
    s_cal_done           = true;
    s_cal_success        = true;
    s_cur_pos            = 100;
    s_tgt_pos            = 100;
    s_motion             = MOTION_STOPPED;

    current_pos_ch.value = HOMEKIT_UINT8(100);
    target_pos_ch.value  = HOMEKIT_UINT8(100);
    s_cal_state          = CAL_IDLE;

    nvs_save_calibration(elapsed);
    nvs_save_last_position(100);
    homekit_notify_position();

    ESP_LOGI(TAG_CAL, "Calibration complete: travel time = %lu ms",
             (unsigned long)elapsed);
}

static void calibration_task(void *arg) {
    ESP_LOGI(TAG_CAL, "=== CALIBRATION START ===");

    s_cal_success = false;
    s_motion      = MOTION_STOPPED;
    relays_all_off();
    vTaskDelay(pdMS_TO_TICKS(300));

