AchimPieters/esp32-homekit-Sunshade/main/main.c
    // ── Phase 1: drive to closed end-stop ─────────────────────────────────────
    ESP_LOGI(TAG_CAL, "Phase 1: closing fully (LED: fast blink)...");
    s_cal_state = CAL_CLOSING;

    uint32_t close_ms = (uint32_t)(s_cal_ms * ENDSTOP_BUFFER_FACTOR);
    if (close_ms < 8000) {
        close_ms = 8000;
    }

    relay_activate_close();
    vTaskDelay(pdMS_TO_TICKS(close_ms));
    relays_all_off();

    s_cur_pos            = 0;
    s_tgt_pos            = 0;
    s_motion             = MOTION_STOPPED;
    current_pos_ch.value = HOMEKIT_UINT8(0);
    target_pos_ch.value  = HOMEKIT_UINT8(0);
    homekit_notify_position();

    vTaskDelay(pdMS_TO_TICKS(500));

    // ── Phase 2: open and wait for user to press STOP ─────────────────────────
    ESP_LOGI(TAG_CAL, "Phase 2: opening (LED: slow blink) - press STOP when fully open");

    s_cal_t0_ms          = now_ms();
    s_cal_state          = CAL_OPENING;
    s_motion             = MOTION_OPENING;
    target_pos_ch.value  = HOMEKIT_UINT8(100);
    relay_activate_open();
    homekit_notify_position();

    uint32_t t_start        = now_ms();
    uint32_t last_notify_ms = t_start;
    uint32_t last_log_ms    = t_start;
    uint32_t ref_ms         = (s_cal_ms > 0) ? s_cal_ms : DEFAULT_TRAVEL_MS;
    int      last_notified  = 0;

    while (s_cal_state == CAL_OPENING) {
        uint32_t now = now_ms();

        if ((now - t_start) > CAL_OPEN_MAX_MS) {
            ESP_LOGW(TAG_CAL, "Timeout: calibration aborted after %lu s",
                     (unsigned long)(CAL_OPEN_MAX_MS / 1000));
            relays_all_off();
            s_cal_success = false;
            s_cal_state   = CAL_IDLE;
            s_cur_pos     = 0;
            s_tgt_pos     = 0;
            s_motion      = MOTION_STOPPED;
            homekit_notify_position();
            break;
        }

        // Live position estimate: only notify HomeKit when integer value changes.
        if ((now - last_notify_ms) >= POS_UPDATE_INTERVAL_MS) {
            uint32_t elapsed = now - s_cal_t0_ms;
            int estimated    = (int)((float)elapsed / (float)ref_ms * 100.0f);
            if (estimated > 99) estimated = 99;
            s_cur_pos = estimated;
            if (estimated != last_notified) {
                last_notified = estimated;
                homekit_notify_position();
            }
            last_notify_ms = now;
        }

        // Serial progress log every second for installer/monitor feedback.
        if ((now - last_log_ms) >= 1000) {
            uint32_t elapsed = now - s_cal_t0_ms;
            int pct = (int)((float)elapsed / (float)ref_ms * 100.0f);
            if (pct > 99) pct = 99;
            ESP_LOGI(TAG_CAL, "Opening... ~%d%% (%lu s) - press STOP when fully open",
                     pct, (unsigned long)(elapsed / 1000));
            last_log_ms = now;
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }

    ESP_LOGI(TAG_CAL, "=== CALIBRATION END (state: %s) ===",
             s_cal_success ? "SUCCESS" : "ABORTED");

    vTaskDelete(NULL);
}

static void calibration_start(void) {
    if (s_cal_state != CAL_IDLE) {
        return;
    }

    if (s_is_homing) {
        ESP_LOGW(TAG_CAL, "Cannot calibrate while homing");
        return;
    }

    if (xTaskCreate(calibration_task, "cal_task", 4096, NULL, 4, NULL) != pdPASS) {
        ESP_LOGE(TAG_CAL, "Failed to create calibration task");
        return;
    }
    if (xTaskCreate(calibration_led_task, "cal_led", 1024, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG_CAL, "Failed to create calibration LED task");
    }
}

// ── Boot homing ───────────────────────────────────────────────────────────────
static void homing_task(void *arg) {
    uint8_t last_pos = (uint8_t)(uintptr_t)arg;

    ESP_LOGI(TAG, "Homing: closing fully to establish position 0%%...");

    s_is_homing = true;
    s_motion    = MOTION_CLOSING;

    uint32_t close_ms = (uint32_t)(s_cal_ms * ENDSTOP_BUFFER_FACTOR);
    if (close_ms < 8000) {
        close_ms = 8000;
    }

    relay_activate_close();
    vTaskDelay(pdMS_TO_TICKS(close_ms));
    relays_all_off();

    s_cur_pos = 0;
    s_tgt_pos = 0;
    s_motion  = MOTION_STOPPED;

    current_pos_ch.value = HOMEKIT_UINT8(0);
    target_pos_ch.value  = HOMEKIT_UINT8(0);
    homekit_notify_position();

    ESP_LOGI(TAG, "Homing: position 0%% established");

    vTaskDelay(pdMS_TO_TICKS(500));

    s_is_homing = false;

    if (last_pos > 0 && last_pos <= 100) {
        ESP_LOGI(TAG, "Homing: restoring to last target %d%%", last_pos);
        sunshade_move_to((int)last_pos);
    } else {
        ESP_LOGI(TAG, "Homing complete; sunshade at 0%%");
    }

    vTaskDelete(NULL);
}

// ── Identify ──────────────────────────────────────────────────────────────────
static volatile TaskHandle_t s_identify_task = NULL;

static void accessory_identify_task(void *args) {
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 2; j++) {
            led_write(true);
            vTaskDelay(pdMS_TO_TICKS(100));
            led_write(false);
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        vTaskDelay(pdMS_TO_TICKS(250));
    }

    led_write(false);
    s_identify_task = NULL;
    vTaskDelete(NULL);
}

static void accessory_identify(homekit_value_t _value) {
    ESP_LOGI("INFORMATION", "Accessory identify");
    if (s_identify_task != NULL) {
        return;
    }
    xTaskCreate(accessory_identify_task, "identify",
                1024, NULL, 2, (TaskHandle_t *)&s_identify_task);
}

// ── HomeKit accessory definition ──────────────────────────────────────────────
#define DEVICE_NAME         "HomeKit Sunshade"
#define DEVICE_MANUFACTURER "StudioPieters\xc2\xae"
#define DEVICE_SERIAL       "NLDA4SQN1466"
#define DEVICE_MODEL        "SD466NL/A"

static homekit_characteristic_t name =
    HOMEKIT_CHARACTERISTIC_(NAME, DEVICE_NAME);
static homekit_characteristic_t manufacturer =
    HOMEKIT_CHARACTERISTIC_(MANUFACTURER, DEVICE_MANUFACTURER);
static homekit_characteristic_t serial =
    HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, DEVICE_SERIAL);
static homekit_characteristic_t model =
    HOMEKIT_CHARACTERISTIC_(MODEL, DEVICE_MODEL);
static homekit_characteristic_t revision =
    HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
static homekit_characteristic_t ota_trigger = API_OTA_TRIGGER;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
    HOMEKIT_ACCESSORY(.id = 1,
                      .category = homekit_accessory_category_window_covering,
                      .services = (homekit_service_t*[]) {
        HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t*[]) {
            &name,
            &manufacturer,
            &serial,
            &model,
            &revision,
            HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
            NULL
        }),
        HOMEKIT_SERVICE(WINDOW_COVERING, .primary = true, .characteristics = (homekit_characteristic_t*[]) {
            HOMEKIT_CHARACTERISTIC(NAME, "Sun Screen"),
            &current_pos_ch,
            &target_pos_ch,
            &pos_state_ch,
            &hold_pos_ch,
            &ota_trigger,
            NULL
        }),
        NULL
    }),
    NULL
};
#pragma GCC diagnostic pop

static homekit_server_config_t hk_config = {
    .accessories = accessories,
    .password    = CONFIG_ESP_SETUP_CODE,
    .setupId     = CONFIG_ESP_SETUP_ID,
};

