AchimPieters/esp32-homekit-Sunshade/main/main.c
// ── TTP223 digital touch inputs ───────────────────────────────────────────────
typedef struct {
    gpio_num_t gpio;
    bool stable;
    bool last_raw;
    uint32_t changed_at_ms;
} debounced_input_t;

static bool ttp_read_raw(gpio_num_t gpio) {
    return gpio_get_level(gpio) == TTP_ACTIVE_LEVEL;
}

static bool debounce_update(debounced_input_t *input) {
    bool raw     = ttp_read_raw(input->gpio);
    uint32_t now = now_ms();

    if (raw != input->last_raw) {
        input->last_raw      = raw;
        input->changed_at_ms = now;
    }

    if ((now - input->changed_at_ms) >= TTP_DEBOUNCE_MS) {
        input->stable = raw;
    }

    return input->stable;
}

static void ttp_gpio_init_one(gpio_num_t gpio) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << gpio),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };

    ESP_ERROR_CHECK(gpio_config(&io_conf));
}

static void ttp_init(void) {
    ttp_gpio_init_one((gpio_num_t)TTP_UP_GPIO);
    ttp_gpio_init_one((gpio_num_t)TTP_STOP_GPIO);
    ttp_gpio_init_one((gpio_num_t)TTP_DOWN_GPIO);

    ESP_LOGI(TAG_TOUCH,
             "TTP223 inputs: UP=GPIO%d STOP=GPIO%d DOWN=GPIO%d active_level=%d debounce=%dms poll=%dms",
             TTP_UP_GPIO, TTP_STOP_GPIO, TTP_DOWN_GPIO,
             TTP_ACTIVE_LEVEL, TTP_DEBOUNCE_MS, TTP_POLL_MS);
}

static void ttp_task(void *arg) {
    // Seed from actual GPIO state: a sensor already active at boot must not
    // trigger a false rising edge on the first poll.
    uint32_t t0       = now_ms();
    bool init_up      = ttp_read_raw((gpio_num_t)TTP_UP_GPIO);
    bool init_stop    = ttp_read_raw((gpio_num_t)TTP_STOP_GPIO);
    bool init_down    = ttp_read_raw((gpio_num_t)TTP_DOWN_GPIO);

    debounced_input_t up = {
        .gpio          = (gpio_num_t)TTP_UP_GPIO,
        .stable        = init_up,
        .last_raw      = init_up,
        .changed_at_ms = t0,
    };

    debounced_input_t stop_in = {
        .gpio          = (gpio_num_t)TTP_STOP_GPIO,
        .stable        = init_stop,
        .last_raw      = init_stop,
        .changed_at_ms = t0,
    };

    debounced_input_t down = {
        .gpio          = (gpio_num_t)TTP_DOWN_GPIO,
        .stable        = init_down,
        .last_raw      = init_down,
        .changed_at_ms = t0,
    };

    bool up_prev   = init_up;
    bool stop_prev = init_stop;
    bool down_prev = init_down;

    // Wall-clock timestamp for hold detection avoids poll-jitter accumulation error.
    uint32_t stop_press_start = 0;
    bool     cal_armed        = false;

    for (;;) {
        bool up_now   = debounce_update(&up);
        bool stop_now = debounce_update(&stop_in);
        bool down_now = debounce_update(&down);

        if (up_now && !up_prev) {
            ESP_LOGI(TAG_TOUCH, "UP touched -> opening");
            sunshade_open();
        }

        if (down_now && !down_prev) {
            ESP_LOGI(TAG_TOUCH, "DOWN touched -> closing");
            sunshade_close();
        }

        if (stop_now) {
            if (!stop_prev) {
                stop_press_start = now_ms();
            }

            if (!cal_armed && (now_ms() - stop_press_start) >= CAL_HOLD_TRIGGER_MS) {
                ESP_LOGI(TAG_TOUCH, "STOP held %lu ms -> calibration trigger",
                         (unsigned long)(now_ms() - stop_press_start));
                cal_armed = true;
                calibration_start();
            }
        } else {
            if (stop_prev && !cal_armed) {
                if (s_cal_state == CAL_OPENING) {
                    ESP_LOGI(TAG_TOUCH, "STOP -> confirm fully open");
                    calibration_confirm_open();
                } else {
                    ESP_LOGI(TAG_TOUCH, "STOP touched -> stopping");
                    sunshade_stop();
                }
            }

            cal_armed = false;
        }

        up_prev   = up_now;
        stop_prev = stop_now;
        down_prev = down_now;

        vTaskDelay(pdMS_TO_TICKS(TTP_POLL_MS));
    }
}

// ── Physical button ───────────────────────────────────────────────────────────
static void button_callback(button_event_t event, void *context) {
    switch (event) {
    case button_event_single_press:
        ESP_LOGI(TAG_BUTTON, "Single press -> update/reboot");
        relays_all_off();
        lifecycle_request_update_and_reboot();
        break;

    case button_event_double_press:
        ESP_LOGI(TAG_BUTTON, "Double press -> HomeKit reset + restart");
        relays_all_off();
        homekit_server_reset();
        esp_restart();
        break;

    case button_event_long_press:
        ESP_LOGI(TAG_BUTTON, "Long press -> factory reset + reboot");
        relays_all_off();
        lifecycle_factory_reset_and_reboot();
        break;

    default:
        ESP_LOGI(TAG_BUTTON, "Unknown button event: %d", event);
        break;
    }
}

// ── GPIO init ─────────────────────────────────────────────────────────────────
static void gpio_init_all(void) {
    gpio_reset_pin(LED_GPIO);
    gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
    led_write(false);

    gpio_reset_pin(RELAY_OPEN_GPIO);
    gpio_set_direction(RELAY_OPEN_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(RELAY_OPEN_GPIO, 0);

    gpio_reset_pin(RELAY_CLOSE_GPIO);
    gpio_set_direction(RELAY_CLOSE_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(RELAY_CLOSE_GPIO, 0);

    ESP_LOGI(TAG, "GPIO: LED=%d RELAY_OPEN=%d RELAY_CLOSE=%d",
             LED_GPIO, RELAY_OPEN_GPIO, RELAY_CLOSE_GPIO);
}

// ── WiFi ready ────────────────────────────────────────────────────────────────
static void on_wifi_ready(void) {
    static volatile bool homekit_started = false;

    if (homekit_started) {
        ESP_LOGI("INFORMATION", "HomeKit already running; skipping re-init");
        return;
    }

    ESP_LOGI("INFORMATION", "Starting HomeKit server...");
    homekit_server_init(&hk_config);
    homekit_started = true;
}

