AchimPieters/esp32-homekit-Sunshade/main/main.c
    ttp_init();

    if (xTaskCreate(ttp_task, "ttp_task", 4096, NULL, 5, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create TTP task");
    }

    // Physical lifecycle button.
    // Wiring: GND -> button -> GPIO25.
    // Active-low requires a pull-up. Configure it explicitly so the input
    // cannot float if the button library does not enable the pull-up itself.
    gpio_config_t btn_io = {
        .pin_bit_mask = (1ULL << BUTTON_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&btn_io));

    ESP_LOGI(TAG_BUTTON, "Physical button GPIO%d level at boot: %d",
             BUTTON_GPIO, gpio_get_level(BUTTON_GPIO));

    button_config_t btn_cfg    = button_config_default(button_active_low);
    btn_cfg.max_repeat_presses = 3;
    btn_cfg.long_press_time    = 3000;

    if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
        ESP_LOGE(TAG_BUTTON, "Failed to init button on GPIO%d", BUTTON_GPIO);
    }

    if (s_cal_done) {
        uint8_t last_pos = nvs_load_last_position();
        ESP_LOGI(TAG, "Calibrated: starting homing sequence (last pos: %d%%)", last_pos);
        if (xTaskCreate(homing_task, "homing", 4096,
                        (void *)(uintptr_t)last_pos, 4, NULL) != pdPASS) {
            ESP_LOGE(TAG, "Failed to create homing task");
        }
    } else {
        ESP_LOGW(TAG, "Not calibrated: skipping homing.");
        ESP_LOGW(TAG, "Hold STOP touch pad for 3 s to start calibration.");
    }

#ifdef CONFIG_WIND_SENSOR_ENABLE
    if (xTaskCreate(wind_task, "wind_task", 3072, NULL, 3, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create wind task");
    }
#endif

    esp_err_t wifi_err = wifi_start(on_wifi_ready);

    if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW("WIFI", "WiFi not configured; provisioning required");
    } else if (wifi_err != ESP_OK) {
        ESP_LOGE("WIFI", "WiFi start failed: %s", esp_err_to_name(wifi_err));
    }
}
